using System;
//2) Реализовать библиотеку классов для игры RPG (не менее 10 классов),
//используя изученные правила наследования).
//Определить базовые классы для важных сущностей, использовать наследование конструкторов,
//переопределение методов и расширение функционала для различных классов.

//Реализовать простую логику взаимодействия объектов между собой.
//Реализовать объект наблюдатель, который с заданной периодичностью будет собирать
//данные от всех созданных объектов на данный момент и записывать ее в лог.

namespace ClassLibrary
{
    public class Unit
    {

    }
}
